In [1]:
import pandas as pd
import numpy as np
import random
from IPython.display import display, HTML
import matplotlib.pyplot as plt

studentsData = pd.read_csv('StudentsPerformance.csv')
namesData = pd.read_csv('all_goalkeepers.csv')

studentsData.insert(0,'Name',namesData['Player'])
studentsData.insert(2,'Age',[random.randint(18,28) for i in range(studentsData.shape[0])])

studentsData = studentsData.rename(columns = {"race/ethnicity": "ethnicity", "parental level of education": "parental education"})

studentsData.to_csv('final.csv')

studentsData

,Name,gender,Age,ethnicity,parental education,lunch,test preparation course,math score,reading score,writing score
0,Mark Dodd,female,18,group B,bachelor's degree,standard,none,72,72,74
1,Tony Meola,female,23,group C,some college,standard,completed,69,90,88
2,Mark Dougherty,female,27,group B,master's degree,standard,none,90,95,93
3,Jorge Campos,male,23,group A,associate's degree,free/reduced,none,47,57,44
4,Garth Lagerwey,male,20,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...,...,...
995,Luis Robles,female,26,group E,master's degree,standard,completed,88,99,95
996,Zack Steffen,male,21,group C,high school,free/reduced,none,62,55,55
997,Bobby Shuttleworth,female,27,group C,high school,free/reduced,completed,59,71,65
998,Stefan Frei,female,21,group D,some college,standard,completed,68,78,77
999,Joe Bendik,female,26,group D,some college,free/reduced,none,77,86,86

General Analysis

In [2]:
def datasetAnalysis(dataset):
    display(HTML('<h4>Analysis by gender</h4'))
    display(dataset.groupby("gender").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by age</h4'))
    display(dataset.groupby("Age").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by ethnicity</h4'))
    display(dataset.groupby("ethnicity").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by parental level of education</h4'))
    display(dataset.groupby("parental education").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by Lunch</h4'))
    display(dataset.groupby("lunch").mean()[["math score","reading score","writing score"]])

In [3]:
datasetAnalysis(pd.read_csv('final.csv'))

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

     math score  reading score  writing score
Age
18    67.642105      70.042105      68.315789
19    64.204082      67.561224      66.948980
20    63.741573      67.539326      66.797753
21    66.187500      68.600000      68.000000
22    67.739130      70.532609      69.771739
23    65.071429      67.663265      66.418367
24    67.456790      69.987654      68.061728
25    67.414141      71.737374      70.808081
26    67.095745      70.095745      69.170213
27    65.656250      69.010417      67.447917
28    64.692308      67.820513      66.538462

           math score  reading score  writing score
ethnicity
group A     61.629213      64.674157      62.674157
group B     63.452632      67.352632      65.600000
group C     64.463950      69.103448      67.827586
group D     67.362595      70.030534      70.145038
group E     73.821429      73.028571      71.407143

                    math score  reading score  writing score
parental education
associate's degree   67.882883      70.927928      69.896396
bachelor's degree    69.389831      73.000000      73.381356
high school          62.137755      64.704082      62.448980
master's degree      69.745763      75.372881      75.677966
some college         67.128319      69.460177      68.840708
some high school     63.497207      66.938547      64.888268

              math score  reading score  writing score
lunch
free/reduced   58.921127      64.653521      63.022535
standard       70.034109      71.654264      70.823256